In [665]:
# Dependencies
import pandas as pd
import numpy as np

In [666]:
# Load and read in AtheleteEvents
data_load1 = "../csv_data/athlete_events.csv"
athelte_data = pd.read_csv(data_load1)
athelte_data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [667]:
# Select desired columns
medal_data = pd.DataFrame(athelte_data, columns=['Sex', 'Team', 'NOC', 'Games', 'Year', 'Season', 'City', 'Sport', 'Medal'])
medal_data.head()

,Sex,Team,NOC,Games,Year,Season,City,Sport,Medal
0,M,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,NaN
1,M,China,CHN,2012 Summer,2012,Summer,London,Judo,NaN
2,M,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,NaN
3,M,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Gold
4,F,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,NaN

In [668]:
# Drop NA medals
medal_data = medal_data.dropna(subset= ['Medal'])
medal_data.head()

,Sex,Team,NOC,Games,Year,Season,City,Sport,Medal
3,M,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Gold
37,M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
38,M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
40,M,Finland,FIN,2014 Winter,2014,Winter,Sochi,Ice Hockey,Bronze
41,M,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Bronze

In [669]:
# Select desired Years
medal_data = medal_data.loc[medal_data['Year'] < 2013]
medal_data_clean = medal_data.set_index('Sex')
medal_data_clean.head()

,Team,NOC,Games,Year,Season,City,Sport,Medal
Sex,,,,,,,,
M,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Gold
M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
M,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Bronze
M,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gold

In [670]:
# Bronze medals
bronze_df = medal_data.loc[medal_data["Medal"] == "Bronze"]
country_b = bronze_df.groupby("NOC")
country_b = country_b['Medal'].count()
bronze_medals = pd.DataFrame(country_b)
bronze_medals = bronze_medals.rename(columns={'Medal': 'Bronze'})
bronze_medals.head()

     Bronze
NOC
AFG       2
ALG       8
ANZ       5
ARG      91
ARM       9

In [671]:
# Silver medals
silver_df = medal_data.loc[medal_data["Medal"] == "Silver"]
country_s = silver_df.groupby("NOC")
country_s = country_s['Medal'].count()
silver_medals = pd.DataFrame(country_s)
silver_medals = silver_medals.rename(columns={'Medal': 'Silver'})
silver_medals.head()

     Silver
NOC
AHO       1
ALG       2
ANZ       4
ARG      91
ARM       2

In [672]:
# Gold medals
gold_df = medal_data.loc[medal_data["Medal"] == "Gold"]
country_g = gold_df.groupby("NOC")
country_g = country_g['Medal'].count()
gold_medals = pd.DataFrame(country_g)
gold_medals = gold_medals.rename(columns={'Medal': 'Gold'})
gold_medals.head()

     Gold
NOC
ALG     5
ANZ    20
ARG    70
ARM     1
AUS   325

In [673]:
bronze_silver_merge = bronze_medals.join(silver_medals)
country_medal_data = bronze_silver_merge.join(gold_medals)
country_medal_data = country_medal_data.fillna(0)
country_medal_data = country_medal_data.astype(int)
country_medal_data.head()

     Bronze  Silver  Gold
NOC
AFG       2       0     0
ALG       8       2     5
ANZ       5       4    20
ARG      91      91    70
ARM       9       2     1

In [674]:
# Save to CSV
# country_medal_data.to_csv('../csv_data/country_medal_data.csv')

medal_data_clean.to_csv('../csv_data/athlete_medal_data.csv')

In [675]:
# Load in Temps. of Country
data_load3 = "../csv_data/GlobalLandTemperaturesByCountry.csv"
country_temp_data = pd.read_csv(data_load3)
country_temp_data.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Aland Islands
1,1743-12-01,NaN,NaN,Aland Islands
2,1744-01-01,NaN,NaN,Aland Islands
3,1744-02-01,NaN,NaN,Aland Islands
4,1744-03-01,NaN,NaN,Aland Islands

In [676]:
# Select desired rows and drop na
country_temp = pd.DataFrame(country_temp_data, columns= ['dt', 'AverageTemperature', 'Country'])
country_temp = country_temp.dropna()
country_temp = country_temp.rename(columns={'dt': 'Year'})
country_temp.head()

         Year  AverageTemperature        Country
0  1743-11-01               4.384  Aland Islands
5  1744-04-01               1.530  Aland Islands
6  1744-05-01               6.702  Aland Islands
7  1744-06-01              11.609  Aland Islands
8  1744-07-01              15.342  Aland Islands

In [677]:
country_temp['Year'] = pd.DatetimeIndex(country_temp['Year']).year
country_temp.head()

   Year  AverageTemperature        Country
0  1743               4.384  Aland Islands
5  1744               1.530  Aland Islands
6  1744               6.702  Aland Islands
7  1744              11.609  Aland Islands
8  1744              15.342  Aland Islands

In [678]:
# Select desired Years
country_temp = country_temp.loc[country_temp['Year'] > 1895]
country_temp = country_temp.loc[country_temp['Year'] < 2013]
country_temp.head()

      Year  AverageTemperature        Country
1826  1896              -0.841  Aland Islands
1827  1896              -0.718  Aland Islands
1828  1896              -0.704  Aland Islands
1829  1896               1.632  Aland Islands
1830  1896               6.457  Aland Islands

In [679]:
country_temp = pd.merge(left=country_temp, right=noc_data, left_on="Country", right_on="region")
country_temp = country_temp.rename(columns={'NOC_x': 'NOC'})
country_temp.head()

   Year  AverageTemperature      Country  NOC       region
0  1896               3.915  Afghanistan  AFG  Afghanistan
1  1896               3.359  Afghanistan  AFG  Afghanistan
2  1896               9.380  Afghanistan  AFG  Afghanistan
3  1896              14.163  Afghanistan  AFG  Afghanistan
4  1896              20.712  Afghanistan  AFG  Afghanistan

In [680]:
country_temp = country_temp.groupby(['Country', 'Year', 'NOC'])
country_temp = country_temp['AverageTemperature'].mean()
country_temp = country_temp.reset_index()
country_temp.head()

       Country  Year  NOC  AverageTemperature
0  Afghanistan  1896  AFG           14.098750
1  Afghanistan  1897  AFG           13.549750
2  Afghanistan  1898  AFG           13.461583
3  Afghanistan  1899  AFG           14.395833
4  Afghanistan  1900  AFG           13.749333

In [681]:
country_temp.reset_index(drop=True, inplace=False)
country_temp_clean = pd.DataFrame(country_temp)
country_temp_clean.head()

       Country  Year  NOC  AverageTemperature
0  Afghanistan  1896  AFG           14.098750
1  Afghanistan  1897  AFG           13.549750
2  Afghanistan  1898  AFG           13.461583
3  Afghanistan  1899  AFG           14.395833
4  Afghanistan  1900  AFG           13.749333

In [682]:
country_temp_clean = country_temp_clean.set_index('Country')
country_temp_clean.head()

             Year  NOC  AverageTemperature
Country
Afghanistan  1896  AFG           14.098750
Afghanistan  1897  AFG           13.549750
Afghanistan  1898  AFG           13.461583
Afghanistan  1899  AFG           14.395833
Afghanistan  1900  AFG           13.749333

In [683]:
# Save to CSV
country_temp_clean.to_csv('../csv_data/country_temperature_data.csv')

In [684]:
# Load in Temps. of City
data_load4 = "../csv_data/GlobalLandTemperaturesByMajorCity.csv"
city_temp_data = pd.read_csv(data_load4)
city_temp_data.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01-01,26.704,1.435,Abidjan,Cote d'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Cote d'Ivoire,5.63N,3.23W
2,1849-03-01,28.101,1.612,Abidjan,Cote d'Ivoire,5.63N,3.23W
3,1849-04-01,26.140,1.387,Abidjan,Cote d'Ivoire,5.63N,3.23W
4,1849-05-01,25.427,1.200,Abidjan,Cote d'Ivoire,5.63N,3.23W

In [685]:
# Select desired rows and drop na
city_temp = pd.DataFrame(city_temp_data, columns= ['dt', 'AverageTemperature', 'City', 'Country', 'Latitude', 'Longitude'])
city_temp = city_temp.dropna()
city_temp = city_temp.rename(columns={'dt': 'Year'})
city_temp.head()

         Year  AverageTemperature     City        Country Latitude Longitude
0  1849-01-01              26.704  Abidjan  Cote d'Ivoire    5.63N     3.23W
1  1849-02-01              27.434  Abidjan  Cote d'Ivoire    5.63N     3.23W
2  1849-03-01              28.101  Abidjan  Cote d'Ivoire    5.63N     3.23W
3  1849-04-01              26.140  Abidjan  Cote d'Ivoire    5.63N     3.23W
4  1849-05-01              25.427  Abidjan  Cote d'Ivoire    5.63N     3.23W

In [686]:
# Change dt to Year
city_temp['Year'] = pd.DatetimeIndex(city_temp['Year']).year
city_temp.head()

   Year  AverageTemperature     City        Country Latitude Longitude
0  1849              26.704  Abidjan  Cote d'Ivoire    5.63N     3.23W
1  1849              27.434  Abidjan  Cote d'Ivoire    5.63N     3.23W
2  1849              28.101  Abidjan  Cote d'Ivoire    5.63N     3.23W
3  1849              26.140  Abidjan  Cote d'Ivoire    5.63N     3.23W
4  1849              25.427  Abidjan  Cote d'Ivoire    5.63N     3.23W

In [687]:
# Changing Latitude South and Longitude South to negative
city_temp['Lat'] = pd.np.where(city_temp.Latitude.str.contains("S"), "-" + city_temp['Latitude'], city_temp['Latitude'])
city_temp['Long'] = pd.np.where(city_temp.Longitude.str.contains("W"), "-" + city_temp['Longitude'], city_temp['Longitude'])

# Slicing of N and W from Latitude and Longitude and adding (-) to longitude
city_temp['Lat'] = city_temp['Lat'].str[:-1]
city_temp['Long'] = city_temp['Long'].str[:-1]

city_temp.head()

,Year,AverageTemperature,City,Country,Latitude,Longitude,Lat,Long
0,1849,26.704,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
1,1849,27.434,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
2,1849,28.101,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
3,1849,26.140,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
4,1849,25.427,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23

In [688]:
# Drop Latitude and Longitude Columns
city_temp = city_temp.drop(columns=['Latitude', 'Longitude'])

# Rename Lat and Long Columns
city_temp = city_temp.rename(columns={'Lat': 'Latitude', 'Long':'Longitude'})

city_temp.head()

   Year  AverageTemperature     City        Country Latitude Longitude
0  1849              26.704  Abidjan  Cote d'Ivoire     5.63     -3.23
1  1849              27.434  Abidjan  Cote d'Ivoire     5.63     -3.23
2  1849              28.101  Abidjan  Cote d'Ivoire     5.63     -3.23
3  1849              26.140  Abidjan  Cote d'Ivoire     5.63     -3.23
4  1849              25.427  Abidjan  Cote d'Ivoire     5.63     -3.23

In [689]:
# Select desired Years
city_temp = city_temp.loc[city_temp['Year'] > 1895]
city_temp = city_temp.loc[city_temp['Year'] < 2013]

city_temp.head()

     Year  AverageTemperature     City        Country Latitude Longitude
564  1896              26.059  Abidjan  Cote d'Ivoire     5.63     -3.23
565  1896              27.611  Abidjan  Cote d'Ivoire     5.63     -3.23
566  1896              26.907  Abidjan  Cote d'Ivoire     5.63     -3.23
567  1896              26.635  Abidjan  Cote d'Ivoire     5.63     -3.23
568  1896              25.530  Abidjan  Cote d'Ivoire     5.63     -3.23

In [690]:
city_temp = pd.merge(left=city_temp, right=noc_data, left_on="Country", right_on="region")
city_temp.head()

,Year,AverageTemperature,City,Country,Latitude,Longitude,NOC,region
0,1896,17.076,Addis Abeba,Ethiopia,8.84,38.11,ETH,Ethiopia
1,1896,17.911,Addis Abeba,Ethiopia,8.84,38.11,ETH,Ethiopia
2,1896,18.869,Addis Abeba,Ethiopia,8.84,38.11,ETH,Ethiopia
3,1896,19.186,Addis Abeba,Ethiopia,8.84,38.11,ETH,Ethiopia
4,1896,18.924,Addis Abeba,Ethiopia,8.84,38.11,ETH,Ethiopia

In [691]:
# Groupby City, Year, Latitude, Longitude
# Determine mean of Temp
city_temp = city_temp.groupby(['region','NOC','City', 'Year', 'Latitude', 'Longitude'])
city_temp = city_temp['AverageTemperature'].mean()
city_temp = city_temp.reset_index()
city_temp.head()

        region  NOC   City  Year Latitude Longitude  AverageTemperature
0  Afghanistan  AFG  Kabul  1896    34.56     70.05           14.573750
1  Afghanistan  AFG  Kabul  1897    34.56     70.05           13.692833
2  Afghanistan  AFG  Kabul  1898    34.56     70.05           13.885833
3  Afghanistan  AFG  Kabul  1899    34.56     70.05           14.690000
4  Afghanistan  AFG  Kabul  1900    34.56     70.05           14.111417

In [692]:
city_temp.reset_index(drop=True)
city_temp = pd.DataFrame(city_temp)
city_temp.head()

        region  NOC   City  Year Latitude Longitude  AverageTemperature
0  Afghanistan  AFG  Kabul  1896    34.56     70.05           14.573750
1  Afghanistan  AFG  Kabul  1897    34.56     70.05           13.692833
2  Afghanistan  AFG  Kabul  1898    34.56     70.05           13.885833
3  Afghanistan  AFG  Kabul  1899    34.56     70.05           14.690000
4  Afghanistan  AFG  Kabul  1900    34.56     70.05           14.111417

In [693]:
city_temp = city_temp.set_index('region')
city_temp.head()

             NOC   City  Year Latitude Longitude  AverageTemperature
region
Afghanistan  AFG  Kabul  1896    34.56     70.05           14.573750
Afghanistan  AFG  Kabul  1897    34.56     70.05           13.692833
Afghanistan  AFG  Kabul  1898    34.56     70.05           13.885833
Afghanistan  AFG  Kabul  1899    34.56     70.05           14.690000
Afghanistan  AFG  Kabul  1900    34.56     70.05           14.111417

In [694]:
# Save to CSV
city_temp.to_csv('../csv_data/city_temperature_data.csv')

In [707]:
# Load and read in noc regions
data_load5 = "../csv_data/noc_regions.csv"
noc_data = pd.read_csv(data_load5)
noc_data.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [708]:
noc_data['region'] = pd.np.where(noc_data.region.str.contains("NA"), noc_data['notes'], noc_data['region'])
noc_data.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [709]:
# Drop notes
noc_data = noc_data.drop(columns=['notes'])
noc_data.head()

   NOC       region
0  AFG  Afghanistan
1  AHO      Curacao
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [710]:
noc_data_clean = noc_data.set_index('region')
noc_data_clean.head()

             NOC
region
Afghanistan  AFG
Curacao      AHO
Albania      ALB
Algeria      ALG
Andorra      AND

In [711]:
# Save to CSV
noc_data_clean.to_csv('../csv_data/noc_regions_data.csv')

In [712]:
# country medal data and adding region to the table
country_medal_data = pd.merge(left=country_medal_data, right=noc_data, left_on="NOC", right_on="NOC")
country_medal_data.head()

   NOC     region_x  Bronze  Silver  Gold     region_y
0  AFG  Afghanistan       2       0     0  Afghanistan
1  ALG      Algeria       8       2     5      Algeria
2  ANZ    Australia       5       4    20    Australia
3  ARG    Argentina      91      91    70    Argentina
4  ARM      Armenia       9       2     1      Armenia

In [713]:
# Reorder columns
country_medal_data = country_medal_data.rename(columns={'region_y': 'region'})
column_names = ['region', 'NOC', 'Bronze', 'Silver', 'Gold']
country_medal_data = country_medal_data.reindex(columns=column_names)
country_medal_data.head()

        region  NOC  Bronze  Silver  Gold
0  Afghanistan  AFG       2       0     0
1      Algeria  ALG       8       2     5
2    Australia  ANZ       5       4    20
3    Argentina  ARG      91      91    70
4      Armenia  ARM       9       2     1

In [714]:
country_medal_data = country_medal_data.set_index('NOC')
country_medal_data.head()

          region  Bronze  Silver  Gold
NOC
AFG  Afghanistan       2       0     0
ALG      Algeria       8       2     5
ANZ    Australia       5       4    20
ARG    Argentina      91      91    70
ARM      Armenia       9       2     1

In [715]:
# Save to CSV
country_medal_data.to_csv('../csv_data/country_medal_data.csv')

In [716]:
# import dependencies
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
from passwords import password

In [717]:
# noc data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "noc_regions"

try:

    frame = noc_data_clean.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='fail')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

PostgreSQL Table noc_regions has been created successfully.

In [718]:
# country medal data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "country_medals"

try:

    frame = country_medal_data.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='fail')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

PostgreSQL Table country_medals has been created successfully.

In [719]:
# country temperature to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "country_average_temperature"

try:

    frame = country_temp_clean.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

KeyboardInterrupt:

In [ ]:
# city temperature to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "city_average_temperature"

try:

    frame = city_temp.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

In [ ]:
# athlete medal data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "athlete_medals"

try:

    frame = medal_data_clean.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()